**Using the DataFrame, calculate the following for each subject:
Average marks
Maximum marks
Minimum marks**

In [1]:
import pandas as pd  

data = {
    "Name": ["Ali", "Sara", "John", "Mary", "Alex"],
    "Subject": ["Math", "Science", "Math", "Science", "Math"],
    "Marks": [85, 92, 78, 88, 95]
}

df = pd.DataFrame(data)
df

   Name  Subject  Marks
0   Ali     Math     85
1  Sara  Science     92
2  John     Math     78
3  Mary  Science     88
4  Alex     Math     95

In [16]:
df.groupby("Subject")["Marks"].agg(average="mean",max="max",min="min")

         average  max  min
Subject
Math        86.0   95   78
Science     90.0   92   88

In [17]:
df

   Name  Subject  Marks
0   Ali     Math     85
1  Sara  Science     92
2  John     Math     78
3  Mary  Science     88
4  Alex     Math     95